# Pandas

In [4]:
import pandas as pd

In [6]:
# how to create dataframe
# 1.dictionary
# 2.List

In [8]:
# 1 dictionary
s = {'name':['jay','jaya','jayesh','jayant','jayendra'],
     'age':[23,34,45,56,67],
     'salary':[20000,45000,30000,25000,60000]}

In [12]:
# dataframe
df = pd.DataFrame(s) # pd stands for pandas. # df stands for dataframe
df

       name  age  salary
0       jay   23   20000
1      jaya   34   45000
2    jayesh   45   30000
3    jayant   56   25000
4  jayendra   67   60000

In [26]:
# create d dataframe having info of 10 employeess with their id,name,age,salary
b = {'id':[1,2,3,4,5,6,7,8,9,10],
     'name':['adi','shravan','om','duri','sonal','komal','jaya','ritika','mayuri','shanaya'],
     'age':[23,34,45,56,67,32,12,23,67,65],
     'salary':[20000,45000,30000,25000,60000,76500,21300,54200,56000,54000]}

In [28]:
df = pd.DataFrame(b)
df

   id     name  age  salary
0   1      adi   23   20000
1   2  shravan   34   45000
2   3       om   45   30000
3   4     duri   56   25000
4   5    sonal   67   60000
5   6    komal   32   76500
6   7     jaya   12   21300
7   8   ritika   23   54200
8   9   mayuri   67   56000
9  10  shanaya   65   54000

In [30]:
# using list 
d = [1,2,3,4,5]
e = ['adi','shravan','om','duri','sonal']
f = [32,32,12,34,56]

In [36]:
df1 = pd.DataFrame([d,e,f]) # using list
df2 = df1.T # T is transpose, used to convert rows to columns and vise versa

In [40]:
df2.columns = ['id','name','age'] # for giving names to columns
df2

  id     name age
0  1      adi  32
1  2  shravan  32
2  3       om  12
3  4     duri  34
4  5    sonal  56

In [46]:
tab1 = {'id':[1,2,3,4,5,6,7,8,9,10],
        'name':['Arun','Aditi','Bina','Chandan','Deepa','Esham','Gauri','harish','ishita','joy'],
        'location':['vashi','kalyan','vashi','kalyan','kalyan','vashi','kalyan''vashi','kalyan','kalyan'],
        'salary':[50,45,60,70,80,85,75,45,55,10]}

In [50]:
df3 = pd.DataFrame(tab1)
df3

ValueError: All arrays must be of the same length

In [58]:
o = {'id':[1,2,3,4,5,6,7,8,9,10],
        'name':['Arun','Aditi','Bina','Chandan','Deepa','Esham','Gauri','harish','ishita','joy'],
        'location':['vashi','kalyan','vashi','kalyan','kalyan','vashi','kalyan','vashi','kalyan','kalyan'],
        'salary':[50,45,60,70,80,85,75,45,55,10]}

In [60]:
df3 = pd.DataFrame(o)
df3

   id     name location  salary
0   1     Arun    vashi      50
1   2    Aditi   kalyan      45
2   3     Bina    vashi      60
3   4  Chandan   kalyan      70
4   5    Deepa   kalyan      80
5   6    Esham    vashi      85
6   7    Gauri   kalyan      75
7   8   harish    vashi      45
8   9   ishita   kalyan      55
9  10      joy   kalyan      10

In [62]:
# shape >> used to check length of columns and rows
df3.shape

(10, 4)

In [64]:
# columns >> used to showcase column names
df3.columns

Index(['id', 'name', 'location', 'salary'], dtype='object')

In [68]:
# head >> used to give top 5 rows
df3.head()

   id     name location  salary
0   1     Arun    vashi      50
1   2    Aditi   kalyan      45
2   3     Bina    vashi      60
3   4  Chandan   kalyan      70
4   5    Deepa   kalyan      80

In [70]:
df3.head(3)

   id   name location  salary
0   1   Arun    vashi      50
1   2  Aditi   kalyan      45
2   3   Bina    vashi      60

In [72]:
# tail >> bottom rows
df3.tail()

   id    name location  salary
5   6   Esham    vashi      85
6   7   Gauri   kalyan      75
7   8  harish    vashi      45
8   9  ishita   kalyan      55
9  10     joy   kalyan      10

In [76]:
df3.tail(2)

   id    name location  salary
8   9  ishita   kalyan      55
9  10     joy   kalyan      10

In [78]:
# to retrieve columns >> show only particular column name
df3['name']

0       Arun
1      Aditi
2       Bina
3    Chandan
4      Deepa
5      Esham
6      Gauri
7     harish
8     ishita
9        joy
Name: name, dtype: object

In [82]:
df[['name','salary','id']]

      name  salary  id
0      adi   20000   1
1  shravan   45000   2
2       om   30000   3
3     duri   25000   4
4    sonal   60000   5
5    komal   76500   6
6     jaya   21300   7
7   ritika   54200   8
8   mayuri   56000   9
9  shanaya   54000  10

In [90]:
# to retrive rows
df[:5]

   id     name  age  salary
0   1      adi   23   20000
1   2  shravan   34   45000
2   3       om   45   30000
3   4     duri   56   25000
4   5    sonal   67   60000

In [92]:
df3[['name','salary']][2:6]

      name  salary
2     Bina      60
3  Chandan      70
4    Deepa      80
5    Esham      85

In [98]:
# info >> gives the all info about dataframe
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   id        10 non-null     int64
 1   name      10 non-null     object
 2   location  10 non-null     object
 3   salary    10 non-null     int64
dtypes: int64(2), object(2)
memory usage: 452.0+ bytes

In [100]:
# unique >> gives unique values
df3['location'].unique()

array(['vashi', 'kalyan'], dtype=object)

In [108]:
# value_counts >> counts of values
df3['location'].value_counts()

location
kalyan    6
vashi     4
Name: count, dtype: int64

In [110]:
# sort values >> ascending or descending 
# for aescending
df3['salary'].sort_values()

9    10
1    45
7    45
0    50
8    55
2    60
3    70
6    75
4    80
5    85
Name: salary, dtype: int64

In [112]:
# for descending
df3['salary'].sort_values(ascending=False) # for descending

5    85
4    80
6    75
3    70
2    60
8    55
0    50
1    45
7    45
9    10
Name: salary, dtype: int64

In [118]:
# to sort dataframe by column
df3.sort_values(by='salary',ascending=False)

   id     name location  salary
5   6    Esham    vashi      85
4   5    Deepa   kalyan      80
6   7    Gauri   kalyan      75
3   4  Chandan   kalyan      70
2   3     Bina    vashi      60
8   9   ishita   kalyan      55
0   1     Arun    vashi      50
1   2    Aditi   kalyan      45
7   8   harish    vashi      45
9  10      joy   kalyan      10

In [120]:
# create a dataframe having info of 5 family members with their name,age,gender and relation
# show the names of all member

In [122]:
fam = {'name':['adi','duri','shanaya','mayuri','sonal'],
       'age':[12,32,15,67,32],
       'gender':['male','male','female','female','female'],
       'relation':['grandfather','son','daughter','wife','sister']}

In [124]:
df = pd.DataFrame(fam)
df

      name  age  gender     relation
0      adi   12    male  grandfather
1     duri   32    male          son
2  shanaya   15  female     daughter
3   mayuri   67  female         wife
4    sonal   32  female       sister

In [126]:
# show the names of all member
df['name']

0        adi
1       duri
2    shanaya
3     mayuri
4      sonal
Name: name, dtype: object

In [128]:
df.columns

Index(['name', 'age', 'gender', 'relation'], dtype='object')

In [130]:
df.shape

(5, 4)

In [132]:
df[['name','gender']]

      name  gender
0      adi    male
1     duri    male
2  shanaya  female
3   mayuri  female
4    sonal  female

In [134]:
df.head(3)

      name  age  gender     relation
0      adi   12    male  grandfather
1     duri   32    male          son
2  shanaya   15  female     daughter

In [136]:
# show the details of oldest 2 
df[3:5]

     name  age  gender relation
3  mayuri   67  female     wife
4   sonal   32  female   sister

In [150]:
# show the name and gender of 3rd , 4th, and 5th member
df[['name','gender']][2:6]

      name  gender
2  shanaya  female
3   mayuri  female
4    sonal  female

In [152]:
# show the age of all in decreasing order
df['age'].sort_values(ascending=False)

3    67
1    32
4    32
2    15
0    12
Name: age, dtype: int64

In [192]:
# show the details all according to increaing age
df.sort_values(by='age')

      name  age  gender     relation
0      adi   12    male  grandfather
2  shanaya   15  female     daughter
1     duri   32    male          son
4    sonal   32  female       sister
3   mayuri   67  female         wife

In [190]:
# show the details of 2 oldest members
df.sort_values(by='age',ascending=False)[:2]

     name  age  gender relation
3  mayuri   67  female     wife
1    duri   32    male      son

In [174]:
# show the count of male and female
df['gender'].value_counts()

gender
female    3
male      2
Name: count, dtype: int64

In [178]:
# show the unique values of gender columns
df['gender'].unique()

array(['male', 'female'], dtype=object)

In [188]:
# show the details of 3 youngest members
df.sort_values(by='age')[:3]

      name  age  gender     relation
0      adi   12    male  grandfather
2  shanaya   15  female     daughter
1     duri   32    male          son

In [198]:
# add column
df['pincode']=[10011,10012,10013,10014,10015]
df

      name  age  gender     relation  pincode
0      adi   12    male  grandfather    10011
1     duri   32    male          son    10012
2  shanaya   15  female     daughter    10013
3   mayuri   67  female         wife    10014
4    sonal   32  female       sister    10015

In [208]:
# add details of new member soniya lives in vashi of age 30 which is sister of you having post DA
df.loc[6]=['soniya',30,'vashi','son',34000,'DA'] # dataframename.loc
df

      name  age  gender     relation  pincode post
0      adi   12    male  grandfather    10011   DA
1     duri   32    male          son    10012   DS
2  shanaya   15  female     daughter    10013   DA
3   mayuri   67  female         wife    10014   DS
4    sonal   32  female       sister    10015   DA
6   soniya   30   vashi          son    34000   DA

In [202]:
# add column post and having values da and ds
df['post']=['DA','DS','DA','DS','DA']
df

      name  age  gender     relation  pincode post
0      adi   12    male  grandfather    10011   DA
1     duri   32    male          son    10012   DS
2  shanaya   15  female     daughter    10013   DA
3   mayuri   67  female         wife    10014   DS
4    sonal   32  female       sister    10015   DA

In [210]:
# update row 3 and add below details
df.loc[3]=['adarsh',30,'vashi','son',34000,'Ds']

In [212]:
df

      name  age  gender     relation  pincode post
0      adi   12    male  grandfather    10011   DA
1     duri   32    male          son    10012   DS
2  shanaya   15  female     daughter    10013   DA
3   adarsh   30   vashi          son    34000   Ds
4    sonal   32  female       sister    10015   DA
6   soniya   30   vashi          son    34000   DA

In [230]:
# to remove column
df =df.drop(labels=['post'],axis=1)

In [232]:
df

      name  age  gender     relation
0      adi   12    male  grandfather
1     duri   32    male          son
2  shanaya   15  female     daughter
3   adarsh   30   vashi          son
4    sonal   32  female       sister
6   soniya   30   vashi          son

In [234]:
# to remove row
df = df.drop(index=[3],axis=0)
df

      name  age  gender     relation
0      adi   12    male  grandfather
1     duri   32    male          son
2  shanaya   15  female     daughter
4    sonal   32  female       sister
6   soniya   30   vashi          son

In [236]:
# remove the details of 2nd member
df = df.drop(index=[2],axis=0)
df

     name  age  gender     relation
0     adi   12    male  grandfather
1    duri   32    male          son
4   sonal   32  female       sister
6  soniya   30   vashi          son

In [238]:
# remove multiple rows 
df = df.drop(index = [1,4],axis=0)

In [240]:
df

     name  age gender     relation
0     adi   12   male  grandfather
6  soniya   30  vashi          son

In [244]:
# remove multiple columns
df = df.drop(labels=['gender','age'],axis=1)
df

     name     relation
0     adi  grandfather
6  soniya          son